Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge Properties
The AnalysisEdge type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
Connectivity
 The connectivity of the analysis edge.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Radius
 The radius of the analysis edge.
SplitPositions
 The split positions of the analysis edge.
Top
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace